Revit 2027 API
ParameterTypeId.StairsLandingtypeHasMonolithicSupport Property
 "Monolithic Support": Monolithic Support
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsLandingtypeHasMonolithicSupport { get; }
Public Shared ReadOnly Property StairsLandingtypeHasMonolithicSupport As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsLandingtypeHasMonolithicSupport {
	ForgeTypeId^ get ();
}
static member StairsLandingtypeHasMonolithicSupport : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace